{
  "education": [
    {
      "awards_achievements": [
        "Dean's List Scholar, 2018"
      ],
      "degree": "Bachelor of Science",
      "department": "Mathematics",
      "duration": "2017-2021",
      "school_name": "University of Toronto"
    },
    {
      "awards_achievements": [
        "Department of Mathematics Graduate Award, 2021"
      ],
      "degree": "Master of Science",
      "department": "Mathematics",
      "duration": "2021-2022",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng-katieing",
  "highlighted_projects": [
    {
      "description": "Led a project investigating the classroom culture and its impact on underrepresented students in math and calculus classes. Designed, pilot tested, and distributed a comprehensive survey to approximately 4000 students. Through qualitative and quantitative data analysis, the results highlighted the influence of classroom culture on student engagement, confidence, and future career choices in STEM. Presented a detailed report to the Diversity and Equity committee, enabling informed decision-making on necessary changes and additional support for affected students.",
      "name": "Survey on Classroom Experiences for Underrepresented Groups in Math"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a monitoring agent that collects and records hardware and memory usage data, to provide valuable insights to business owners and team leads for future planning. This tool empowers stakeholders to make informed decisions regarding resource allocation and optimization. The data is stored and queried on a PostgreSQL database for scalable management. This project is meticulously documented to ensure straightforward setup for current and future clients.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Katie Ing",
  "others": [
    {
      "bullets": [
        "Running; completed half-marathon races in Toronto and Denver and currently training for a marathon",
        "Solo traveler; visited 10 countries on various solo trips"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with a team of BSAs and developers using Agile methodology; Created a monitoring agent with SQL to be used for resource planning and allocation; Prepared a BRD for the Linux Cluster Monitoring Agent project; Conducted elicitation requirements meetings in order to create a SRD for a trading app; Provided regular documentation and verbal updates on all projects",
      "duration": "2023-present",
      "title": "Technical Consultant"
    },
    {
      "company": "University of Toronto",
      "description": "Gathered and analyzed qualitative and quantitative data from three projects in the field of post-secondary education and teaching. These projects investigated retention of knowledge and communication development of past students; Served as team lead during the research process (data analysis in Excel and Google Sheets); Authored an ethics application, proposal, surveys, and written report; Presented study results at the Canadian Undergraduate Mathematics Conference in 2019 and the Fields Institute MathEd Forum in 2020.",
      "duration": "2020-2021",
      "title": "Research Assistant"
    },
    {
      "company": "University of Toronto",
      "description": "Facilitated tutorials for students and supported professors with lectures; Independently designed a weekly series of videos and readings for a course with 3000 students as a pre-lecture learning assignment.",
      "duration": "2019-2022",
      "title": "Teaching Assistant"
    }
  ],
  "skills": {
    "Business Skills": [
      "Communication",
      "Collaboration",
      "Leadership",
      "Creative problem-solving",
      "Agile/Scrum"
    ],
    "Technical Skills": [
      "RDBMS/SQL",
      "Data Modeling/Mapping",
      "Data Analytics",
      "Python",
      "MS Excel"
    ]
  },
  "summary": "I am an aspiring Business Systems Analyst with a recent master's degree in mathematics from the University of Toronto. I am drawn to a BSA role because it allows me to merge my exceptional problem-solving skills, developed through my academic background, with my ability to collaborate effectively within teams. With teaching assistant positions, I have developed exceptional communication skills, while research assistant roles have provided experience in data analysis, data gathering and reporting. Currently working as a technical consultant at Jarvis, I have gained proficiency in PostgreSQL. Additionally, I have gained strong relationship development skills through a variety of academic and seasonal positions."
}
