{
  "education": [
    {
      "awards_achievements": [
        "Dean's List Scholar, 2018"
      ],
      "degree": "Bachelor of Science",
      "department": "Department of Mathematics",
      "duration": "2017-2021",
      "school_name": "University of Toronto"
    },
    {
      "awards_achievements": [
        "Department of Mathematics Graduate Award, 2021"
      ],
      "degree": "Master of Science",
      "department": "Department of Mathematics",
      "duration": "2021-2022",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-katieing",
  "highlighted_projects": [
    {
      "description": "Led a project investigating the classroom culture and its impact on underrepresented students in math and calculus classes. Designed, pilot tested, and distributed a comprehensive survey to approximately 4000 students. Through qualitative and quantitative data analysis, the results highlighted the influence of classroom culture on student engagement, confidence, and future career choices in STEM. Presented a detailed report to the Diversity and Equity committee, enabling informed decision-making on necessary changes and additional support for affected students.",
      "git_url": "n/a",
      "name": "Survey on Classroom Experiences for Underrepresented Groups in Math"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a monitoring agent that collects and records hardware and memory usage data, to provide valuable insights to business owners and team leads for future planning. Implemented with Bash scripting, the data for this app is stored and queried on a PostgreSQL database for scalable management. Tested this app manually on a single node, and automated the scripts using cron.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "Established a comprehensive database for a newly established country club using PostgreSQL. Demonstrated usage by executing sample queries and verifying accuracy with test data.",
      "git_url": "/sql",
      "name": "SQL Project"
    },
    {
      "description": [
        "JDBC App: Worked on a JDBC application that interfaces with a PostgreSQL database, enabling CRUD operations for a database within a retail context. Leveraged Java to connect to a sales database, offering functionalities like customer data manipulation and retrieval, as well as order and order item data retrieval. Verified expected behaviour through manual testing of a sample database. Employed Maven for efficient build management.",
        "Grep App: Designed an application to recursively search a directory for lines of text that match a Regex search pattern and write the matching lines to a file. Developed the app using core Java, and harnessed Regex and Stream APIs for efficient processing of large directories and files. Manually tested the app with thorough example use cases and expected user errors. Managed dependencies and build process through Maven, and containerized with Docker. After deployment, added a feature to handle read-access exceptions and increase reporting. "
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed a retail stock trading Spring Boot application for individual/recreational investors. Utilized Spring DAO to manage and persist trader data in a PostgreSQL database and REST web APIs to provide updated stock quotes. Conducted integration tests, unit tests with JUnit and Mockito and manual testing of endpoints with Swagger UI. Containerized the app with docker. Ongoing improvements include re-implementing all DAOs with JPA/Hibernate.",
      "git_url": "/springboot",
      "name": "Springboot App"
    }
  ],
  "name": "Katie Ing",
  "others": [
    {
      "bullets": [
        "Adventurous traveller: visited 13 countries with a preference for solo trips",
        "Passionate about teaching: worked as a swim instructor and supervisor from 2012-2019 and teaching assistant from 2019-2022",
        "Recreational runner: participated in half-marathon events in Toronto and Denver and hoping to complete my first full marathon in 2024"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed Java applications with core Java fundamentals, JDBC, Spring Boot and Maven; Utilized bash scripting to create a Linux monitoring agent, and strong written and oral communication skills to produce business and systems requirements documents; Provided thorough documentation and verbal updates on all projects; Collaborated with a development team using Agile methodology; ",
      "duration": "2023-present",
      "title": "Tehcnical Consultant"
    },
    {
      "company": "University of Toronto",
      "description": "Gathered and analyzed qualitative and quantitative data from three projects in the field of post-secondary education and teaching; Investigated retention of knowledge and communication development of past students; Served as team lead during the research process (data analysis in Excel/Google Sheets and R); Authored an ethics application, proposal, surveys, and written report; Presented study results at the Canadian Undergraduate Mathematics Conference in 2019 and the Fields Institute MathEd Forum in 2020.",
      "duration": "2020-2021",
      "title": "Research Assistant"
    },
    {
      "company": "University of Toronto",
      "description": "Facilitated tutorials for students and supported professors with lectures; Independently designed a weekly series of pre-lecture videos, readings and quizzes for a course with 3000 students.",
      "duration": "2019-2022",
      "title": "Teaching Assistant"
    }
  ],
  "skills": {
    "competent": [
      "Spring/Spring Boot",
      "JDBC",
      "REST APIs",
      "IntelliJ",
      "Python"
    ],
    "familiar": [
      "Docker",
      "Maven",
      "Google Cloud Computing",
      "R",
      "some fifth skill"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am an enthusiastic and ambitious newcomer to the world of software development, holding a recent master's degree in pure mathematics from the University of Toronto. My passion lies in problem-solving, and I thrive on the structured precision found in both computer science and math. I embrace the learning process wholeheartedly, aiming to improve and innovate in every project I undertake."
}
